<?php

use App\Models\Major;
use Carbon\Carbon;
use Illuminate\Database\Seeder;

class MajorsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run(){
        //
        $majorsArrAr = [
            "طب وجراحة",
            "طب الأسنان",
            "دكتور صيدلة",
            "الخدمات الطبية الطارئة",
            "التقنية الطبية الحيوية - أجهزة",
            "التغذية السريرية",
            "علوم المختبرات الإكلينيكية",
            "رعاية الأسنان",
            "علاج علل النطق والسمع",
            "تقنية الأسنان",
            "دكتور بصريات",
            "علوم الأشعة",
            "العلاج الوظيفي",
            "العلاج التنفسي",
            "العلاج الطبيعي",
            "التمريض",
            "الهندسة الكهربائية",
            "الهندسة الكيميائية",
            "الهندسة الصناعية",
            "الهندسة المدنية",
            "هندسة المساحة",
            "الهندسة الميكانيكية",
            "الهندسة المعمارية",
            "هندسة التصميم الداخلي",
            "هندسة الإتصالات والشبكات",
            "هندسة البترول والغاز الطبيعي",
            "هندسة البرمجيات",
            "هندسة الحاسب",
            "علوم الحاسب",
            "نظم المعلومات",
            "تقنية المعلومات",
            "الشبكات وأنظمة الإتصالات",
            "حوسبة الأعمال والتجارة الإلكترونية",
            "الوسائط الرقمية",
            "هندسة البرمجيات",
            "العمارة وعلوم البناء",
            "التخطيط العمراني",
            "الرياضيات الاكتوارية",
            "الكيمياء الحيوية",
            "النبات",
            "الكيمياء",
            "الجيولوجيا",
            "الجيوفيزياء",
            "الرياضيات",
            "الأحياء الدقيقة",
            "بحوث العمليات",
            "الفيزياء",
            "الإحصاء",
            "علم الحيوان",
            "العلوم في الهندسة الزراعية",
            "الاقتصاد التطبيقي",
            "الإنتاج الحيواني",
            "علوم الأغذية وتغذية الإنسان",
            "علوم الإنتاج النباتي",
            "وقاية النبات",
            "الاقتصاد",
            "المصرفية الإسلامية",
            "المحاسبة",
            "إدارة الطيران",
            "المالية",
            "علاقات عامة",
            "ادارة مكاتب",
            "التسويق",
            "إدارة الموارد البشرية",
            "نظم المعلومات الإدارية",
            "الإدارة",
            "اللغة العربية وآدابها",
            "الإعلام",
            "التاريخ",
            "المكتبات والمعلومات",
            "الجغرافيا",
            "علم المعلومات",
            "اللغة الانجليزية وآدابها",
            "علم الاجتماع",
            "الخدمة الاجتماعية",
            "الدراسات القرآنية",
            "الدراسات الإسلامية",
            "التربية الفنِّية",
            "تربية خاصة",
            "تعليم ما قبل المرحلة الإبتدائية",
            "أخصائي نفسي",
            "الحقوق",
            "العلوم السياسية",
            "اللغة الانجليزية والترجمة",
            "اللغة الفرنسية والترجمة",
            "اللغة الأسبانية والترجمة",
            "اللغة العبرية والترجمة",
            "اللغة الروسية والترجمة",
            "اللغة الألمانية والترجمة",
            "اللغة اليابانية والترجمة",
            "اللغة التركية والترجمة",
            "اللغة الصينية والترجمة",
            "اللغة الفارسية والترجمة",
            "اللغويات التطبيقية",
            "إدارة موارد التراث والإرشاد السياحي",
            "الإدارة السياحية والفندقية",
            "الآثار",
            "الادارة الرياضية والترويحية",
            "اللياقة البدنية",
            "التدريب الرياضي",
            "تصميم الأزياء والنسيج",
            "التصميم الداخلي",
            "التصميم الجرافيكي والوسائط الرقمية",
            "التصويت التشكيلي والطباعة",
            "النحت",
            "تاريخ الفن",
            "الابتكار وتصميم المنتجات"
        ];

        if (Major::count() == 0) {
            foreach ($majorsArrAr as $major) {
                Major::create([
                    'name' => $major,
                ]);
            }
        }

    }
}
