<?php

use App\Models\University;
use Illuminate\Database\Seeder;

class UniversitiesSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        //
        $universitiesArrAr = [
            "جامعة رياض العلم", "جامعة أم القرى", 
            "الجامعة الإسلامية", "جامعة الإمام محمد بن سعود الإسلامية", 
            "جامعة الملك عبدالعزيز", "جامعة الملك سعود",
            "جامعة الملك فهد للبترول والمعادن", "جامعة نايف العربية للعلوم الأمنية",
            "جامعة الملك فيصل", "جامعة الملك خالد",
            "جامعة القصيم", "جامعة طيبة",
            "جامعة الطايف", "جامعة حائل",
            "جامعة جازان", "جامعة الجوف",
            "جامعة الباحة", "جامعة تبوك", 
            "جامعة نجران", "جامعة الحدود الشمالية", 
            "جامعة الأميرة نورة بن عبدالرحمن", "جامعة الملك سعود بن عبدالعزيز للعلوم الصحية",
            "جامعة الإمام عبدالرحمن بن فيصل", "جامعة الملك عبدالله للعلوم والتقنية",
            "جامعة الأمير سطام بن عبدالعزيز", "جامعة شقراء",
            "جامعة المجمعة", "الجامعة السعودية الالكترونية",
            "جامعة جدة", "جامعة بيشة",
            "كلية المدربين التقنيين", "جامعة حفر الباطن",
            "كلية الجبيل الصناعية", "كلية ينبع الصناعية",
            "كلية ينبع الجامعية", "كلية الأمير محمد بن سلمان للإدارة وريادة الأعمال",
            "جامعة المستقبل", "كليات سليمان راجحي الأهلية",
            "كلية ابن سينا للعلوم الطبية", "كلية البترجي للعلوم الطبية والتقنية",
            "جامعة الفيصل", "كليات الفارابي الأهلية",
            "كلية المعرفة", "كليات الرياض لطب الأسنان والصيدلة",
            "جامعة دار الحكمة", "جامعة الأمير مقرن بن عبدالعزيز",
            "جامعة دار العلوم", "جامعة الأمير سلطان",
            "جامعة عفت الأهلية", "الجامعة العربية المفتوحة",
            "جامعة اليمامة", "جامعة الأمير فهد بن سلطان",
            "جامعة الأمير محمد بن فهد", "جامعة الأعمال والتكنولوجيا",
            "كلية جدة العالمية", "كليات الريان الأهلية",
            "المؤسسة العامة للتدريب التقني"

        ];




        if (University::count() == 0) {
            foreach ($universitiesArrAr as $university) {
                University::create([
                    'name' => $university,
                ]);
            }
        }
    }
}
