<?php
return [
    "How_it_works?" => "كيف نعمل؟" ,
    "Post_a_Task" =>"عرض المهمة المطلوبة" ,
    "Post_a_Task_description" => "ينشر صاحب المنشأة تفاصيل العمل والمقابل المادي والمدة الزمنية للتسليم، كما يجب مراعاة ذكر تفاصيل الخبرات والمهارات اللازمة لإنجازه بالجودة المرجوّة." ,
    "select" => "اختيار الأنسب للمهمة"  ,
    "select_description" => "يتقدم الطلاب على عرض المهمة الملائمة لمهاراتهم وخبراتهم مع مراعاة ذكر كافة تفاصيل المهارات والخبرات في الملف الشخصي ليتسنى لصاحب المنشأة اختيار الأكثر كفاءة لإنجاز المهمة، كما يمكن التواصل بين صاحب المنشأة والطالب خارج المنصة لتبادل التفاصيل إن وجدت." ,
    "Confirm" => "اعتماد المهمة" ,
    "Confirm_description" => "يبدأ الطالب بإنجاز المهمة بعد تأكيد صاحب المنشأة ومتابعة سير العمل بسهولة من خلال المنصة." ,
    "Review" => "الاطلاع والمراجعة النهائية " ,
    "Review_description" =>"يتابع صاحب المنشأة سير المهمة مع الطالب ومراجعة مختلف التفاصيل وإبداء الملاحظات للانتهاء من العمل بأفضل صورة، وعند الانتهاء منها يمكن لأصحاب المنشأة تقييم مستوى الطالب بحيث يظهر على ملفه الشخصي في المنصة." ,
    "ًWhyHaa_description"=>"نستهدف فئة الطلاب الجامعيين أصحاب المهارات المتنوعة بدعمهم للوصول إلى أصحاب الأعمال لاستثمار مهاراتهم واكتساب خبرات جديدة، ومن مزايا العمل في المنصة: " ,
    "Student" => "الطالب" ,
    "Student_1" => "اكتساب خبرة عملية حول سوق العمل قبل التخرج. " ,
    "Student_2" => "كسب الثقة وبناء حصيلة معارف بين أصحاب الأعمال." ,
    "Student_3" => "تنمية المهارات المتنوعة باختلاف التخصصات والمهام."   ,
    "Student_4" => "مقابل مادي." ,
    "Why_Haa?" => "ما تتفرّد به منصة هاء " , 
    "Why_Haa_description"=> "نستهدف فئة الطلاب الجامعيين أصحاب المهارات المتنوعة بدعمهم للوصول إلى أصحاب الأعمال لاستثمار مهاراتهم واكتساب خبرات جديدة، ومن مزايا العمل في المنصة:" ,
    "Company_1" => "تعدد المتقدمين بمختلف التخصصات والخبرات لإنجاز المهام والمشاريع الكبرى." ,
    "Company_2" => "الاحتفاظ بقاعدة بيانات لأفضل الطلاب بغرض التوظيف لاحقًا." ,
    "Company_3" => "رفع إنتاجية المنشأة وإمكانية العمل على مشاريع كبرى بسبب التعاون مع أكبر عدد من الطلاب." ,
    "Company_4" => "الاستثمار في الشباب ومهاراتهم الإبداعية الناشئة." ,
    "Why_Haa_description_companies" => "على الصعيد الآخر; يُمكن لأصحاب الأعمال الوصول إلى الطلاب الموهوبين والشغوفين لإنجاز المهام بأفضل جودة، وإمكانية الاختيار بسهولة بين المتقدمين وترشيح الأفضل بناءً على معاير تتلاءم مع متطلبات المنشأة، ومن مزايا نشر المهمة على المنصة: " ,
    "about_message_description" => " دعم الشباب من فئة طلاب الجامعة أصحاب المواهب المتنوعة وكسبهم مهاراتٍ عدّة تُحسّن من خبراتهم العملية والعلمية للمستقبل عن طريق تعاونهم مع أصحاب الأعمال. ونُمكّن أصحاب المنشآت بمهارات اختيار الموظف وتقييم جودة عمله بفترة وجيزة، وعليه يتعرّف الطالب على متطلبات سوق العمل حتّى يعمل جاهدًا على تلبيتها. كما نعتزم تقليص الفجوة بين أصحاب الأعمال والأفراد المتميّزين وإتاحة فرص ذهبية تُزهر بالمجتمع وتنمّي التلاحم المهني." ,
    "about_message" => "رسالتنا" ,
    "about_vision_message" => "تزُهر المجتمعات بشبابها الواعد الذي وقوده الشغف والإبداع، وإنّ مشوار الألف ميل نحو الازدهار المجتمعي يبدأ بخطوةٍ نعتزم فيها دعم الكوادر الطموحة بكسبهم لخبراتٍ عملية زاخرة، ونسخّر كافة السبل لتذليل الصعاب على أصحاب الأعمال لتتحقق معًا الأهداف بعيدُة المدى وتُلامس الأحلام أرض الواقع. " ,
    "about_vision"=>"رؤيتنا" ,
    "about_description" => "منصة إلكترونية تربط أصحاب الأعمال بطلاب الجامعة لعرض مهاراتهم تلبيةً لمهام وأعمال جزئية يعرضها صاحب المنشأة بمقابل مادي وخبرة عملية تتيح للطالب فرصة التعرف على متطلبات سوق العمل قبل التخرج. 
    تتنوع مجالات المهام وتخصصاتها إذ يمكن لكلّ طالب شغوف أن يجد محلّه في هاء ،
     وتختلف طبيعتها لتناسب الاختلافات الفردية، إذ يُمكن لصاحب المنشأة أن يعرض الأعمال الجزئية المكتبية في فترة المساء، أو الأعمال الحرّة عن بعد ليتقدم عليها الطالب بعد استكمال الملف الشخصي وإضافة خبراته ومهاراته مما يرفع فرصته لاستحقاق المهمة."
];  